In [1]:
import pandas as pd
df= pd.read_csv("employees.csv")
df

   ID     Name  Salary Department
0   1    Alice   50000         HR
1   2      Bob   60000         IT
2   3  Charlie   55000         IT
3   4    David   70000    Finance
4   5      Eva   65000         HR

In [4]:
#How do you select rows where the Salary column is greater than 50,000 and the Department is "IT"?
df= pd.read_csv("employees.csv")
df=df[(df['Salary']>50000) & (df['Department']=='IT')]
df

   ID     Name  Salary Department
1   2      Bob   60000         IT
2   3  Charlie   55000         IT

In [16]:
#Write a query to find all employees whose City starts with “M” and ends with “i”.
df=pd.read_csv("employees.csv")
df['City']=["Delhi","Mumbai","Kerala","UP","MP"] 
df=df[df['City'].str.startswith("M")& df['City'].str.endswith("i")]
df

   ID Name  Salary Department    City
1   2  Bob   60000         IT  Mumbai

In [21]:
#How do you filter rows where JoiningDate is between 2020-01-01 and 2022-01-01?
df=pd.read_csv("employees.csv")
df['City']=["Delhi","Mumbai","Kerala","UP","MP"] 
df['Joiningdate']=['2020-01-01','2021-01-05','2021-06-08','2025-01-01','2021-07-01']
#df=df[(df['Joiningdate']> pd.to_datetime('2020-01-01')) & (df['Joiningdate']< pd.to_datetime('2022-01-01'))]
df['Joiningdate'] = pd.to_datetime(df['Joiningdate'], errors='coerce')
df = df[(df['Joiningdate'] > pd.to_datetime('2020-01-01')) & 
        (df['Joiningdate'] < pd.to_datetime('2022-01-01'))]
df

   ID     Name  Salary Department    City Joiningdate
1   2      Bob   60000         IT  Mumbai  2021-01-05
2   3  Charlie   55000         IT  Kerala  2021-06-08
4   5      Eva   65000         HR      MP  2021-07-01

In [26]:
#How do you get the total and average salary per department?
import pandas as pd
df=pd.read_csv("employees.csv")
df= df.groupby(['Department'])['Salary'].sum().reset_index()
df=df.rename(columns={"Salary":"Total_Salary"})

df['mtotal']=df['Total_Salary'].mean()
df

  Department  Total_Salary    mtotal
0    Finance         70000  100000.0
1         HR        115000  100000.0
2         IT        115000  100000.0

In [51]:
#How do you get the department that has the highest total salary?
import pandas as pd
df=pd.read_csv("employees.csv")
df=df.groupby(["Department"])['Salary'].sum().reset_index()
df=df.rename(columns={"Salary":"TotalSalary"})
df=df.sort_values("TotalSalary",ascending=False)
max_salary = df['TotalSalary'].max()
dep=df[df['TotalSalary']==max_salary]
dep

  Department  TotalSalary
1         HR       115000
2         IT       115000

In [52]:
#From a DataFrame with columns Department, Gender, and Salary, how would you find the average salary for each gender within each department?
import pandas as pd

data = {
    'Department': ['QA', 'QA', 'QA', 'Dev', 'Dev', 'Dev', 'HR', 'HR', 'HR'],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female'],
    'Salary': [85000, 90000, 80000, 100000, 95000, 98000, 75000, 78000, 77000]
}

df = pd.DataFrame(data)
df.to_csv("employees.csv", index=False)
df=df.groupby(['Gender','Department'])['Salary'].mean().reset_index()
df=df.rename(columns={"Salary":"Average_salary"}) 
df

   Gender Department  Average_salary
0  Female        Dev         95000.0
1  Female         HR         76000.0
2  Female         QA         82500.0
3    Male        Dev         99000.0
4    Male         HR         78000.0
5    Male         QA         90000.0

In [64]:
#How do you find out which columns have missing values and how many?
import pandas as pd
df=pd.read_csv("missing.csv")
df=df.isnull().sum()
missingcol=df[df>0]
missingcol

ename     2
salary    2
deptno    2
doj       2
dtype: int64

In [67]:
#Question 8: Replace missing values in the Age column with the column’s median
import pandas as pd
df=pd.read_csv("missing.csv")
med=df["Age"].median()
df=df["Age"].fillna(median,inplace=True)
df

KeyError: 'Age'